



* Example 2

#+TBLNAME: NPV
| $ | rate=.07       |
| $ | n=50           |
| $ | payment = 1000 |
| # | 13800.75       |
| ^ | Result         |
#+TBLFM: $Result=pv($rate,$n,$payment)

#+TBLNAME: DCF
| [fn:DCF--8] |     Year | Growth [fn:DCF--2] | Cash                 | Discounted Cash     |
|-------------+----------+--------------------+----------------------+---------------------|
| #           |        0 | 0.03               | 500                  | 500                 |
| #           |        1 | 0.15 [fn:DCF--3]   | 575.00 [fn:DCF--7]   | 527.52 [fn:DCF--1]  |
| #           |        2 | 0.15 [fn:DCF--3]   | 661.25 [fn:DCF--7]   | 556.56 [fn:DCF--1]  |
| #           |        3 | 0.15 [fn:DCF--3]   | 760.44 [fn:DCF--7]   | 587.20 [fn:DCF--1]  |
| #           |        4 | 0.15 [fn:DCF--3]   | 874.51 [fn:DCF--7]   | 619.52 [fn:DCF--1]  |
| #           |        5 | 0.15 [fn:DCF--3]   | 1005.69 [fn:DCF--7]  | 653.63 [fn:DCF--1]  |
| #           |        6 | 0.05 [fn:DCF--4]   | 1055.97 [fn:DCF--7]  | 629.64 [fn:DCF--1]  |
| #           |        7 | 0.05 [fn:DCF--4]   | 1108.77 [fn:DCF--7]  | 606.54 [fn:DCF--1]  |
| #           |        8 | 0.05 [fn:DCF--4]   | 1164.21 [fn:DCF--7]  | 584.28 [fn:DCF--1]  |
| #           |        9 | 0.05 [fn:DCF--4]   | 1222.42 [fn:DCF--7]  | 562.84 [fn:DCF--1]  |
| #           |       10 | 0.05 [fn:DCF--4]   | 1283.54 [fn:DCF--7]  | 542.18 [fn:DCF--1]  |
| #           |       10 | 0.03               | 22034.10 [fn:DCF--5] | 9307.44 [fn:DCF--1] |
|             |          | 0.05               | 1 [fn:DCF--6]        | 15677.35            |
| ^           |          |                    | Cash                 | DCF                 |
| $           | g1t5=.15 | g6t10=.05          |                      |                     |
|             |     0.09 | 0.03               |                      |                     |
| $           |  COE=.09 | g=.03              |                      |                     |
#+TBLFM: $3=$g::@3$3=$g1t5::@3$4=@-1*(1+$-1)::@3$5=$-1*(1/(1+$COE)^($-3))::@4$3=$g1t5::@4$4=@-1*(1+$-1)::@4$5=$-1*(1/(1+$COE)^($-3))::@5$3=$g1t5::@5$4=@-1*(1+$-1)::@5$5=$-1*(1/(1+$COE)^($-3))::@6$3=$g1t5::@6$4=@-1*(1+$-1)::@6$5=$-1*(1/(1+$COE)^($-3))::@7$3=$g1t5::@7$4=@-1*(1+$-1)::@7$5=$-1*(1/(1+$COE)^($-3))::@8$3=$g6t10::@8$4=@-1*(1+$-1)::@8$5=$-1*(1/(1+$COE)^($-3))::@9$3=$g6t10::@9$4=@-1*(1+$-1)::@9$5=$-1*(1/(1+$COE)^($-3))::@10$3=$g6t10::@10$4=@-1*(1+$-1)::@10$5=$-1*(1/(1+$COE)^($-3))::@11$3=$g6t10::@11$4=@-1*(1+$-1)::@11$5=$-1*(1/(1+$COE)^($-3))::@12$3=$g6t10::@12$4=@-1*(1+$-1)::@12$5=$-1*(1/(1+$COE)^($-3))::@13$4=(@-1(1+$g))/($COE-$g)::@13$5=$-1*(1/(1+$COE)^($-3))::@14$4=1::$DCF=vsum(@2..@-1)



#+TBLNAME: ScenarioManager
| COE | DCF [fn:ScenarioManager--1] |
|-----+-----------------------------|
| .04 |                    97480.87 |
| .05 |                    48332.71 |
| .06 |                    31973.63 |
| .07 |                    23810.54 |
| .08 |                    18924.93 |
| .09 |                    15677.35 |
| .10 |                    13365.25 |
| .11 |                    11637.39 |
| .12 |                    10298.65 |
#+TBLFM: $2='(org-table-xtras-eval-table "DCF" '(("COE" . $1)) "DCF")

* Footnotes
[fn:ScenarioManager--1] '(org-table-xtras-eval-table "DCF" '(("COE" . \$1)) "DCF")

[fn:DCF--1] \$-1*(1/(1+\$COE)^(\$-3))

[fn:DCF--2] \$g

[fn:DCF--3] \$g1t5

[fn:DCF--4] \$g6t10

[fn:DCF--5] (@-1(1+\$g))/(\$COE-\$g)

[fn:DCF--6] 1

[fn:DCF--7] @-1*(1+\$-1)

[fn:DCF--8] vsum(@2..@-1)


